In [88]:
!pip install graphviz

Requirement already satisfied: graphviz in /Users/jiyoung/anaconda3/lib/python3.6/site-packages (0.9)

In [29]:
import pandas as pd
import numpy as np
from plotnine import *

In [89]:
from sklearn.tree import export_graphviz
import graphviz

# export_graphviz(model,
#                 feature_names = feaure_names,
#                 class_names = ['Perish', 'Survived'],
#                 out_file = "decision=tree.dot")
# with open('decision-tree-dot') as f:
#     dot_graph = f.read()

In [90]:
test = pd.read_csv('test.csv')
test.shape

(418, 11)

In [91]:
train = pd.read_csv('train.csv')
train.shape

(891, 12)

In [92]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [93]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [94]:
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [95]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [96]:
train['Age'].mean()

29.69911764705882

In [97]:
test['Age'].fillna(test['Age'].mean(), inplace = False)

0      34.50000
1      47.00000
2      62.00000
3      27.00000
4      22.00000
5      14.00000
6      30.00000
7      26.00000
8      18.00000
9      21.00000
10     30.27259
11     46.00000
12     23.00000
13     63.00000
14     47.00000
15     24.00000
16     35.00000
17     21.00000
18     27.00000
19     45.00000
20     55.00000
21      9.00000
22     30.27259
23     21.00000
24     48.00000
25     50.00000
26     22.00000
27     22.50000
28     41.00000
29     30.27259
         ...
388    21.00000
389     6.00000
390    23.00000
391    51.00000
392    13.00000
393    47.00000
394    29.00000
395    18.00000
396    24.00000
397    48.00000
398    22.00000
399    31.00000
400    30.00000
401    38.00000
402    22.00000
403    17.00000
404    43.00000
405    20.00000
406    23.00000
407    50.00000
408    30.27259
409     3.00000
410    30.27259
411    37.00000
412    28.00000
413    30.27259
414    39.00000
415    38.50000
416    30.27259
417    30.27259
Name: Age, Length: 418, dtype: float64

In [98]:
train['Age_mean'] = train['Age'].fillna(train['Age'].mean(), inplace = False)
train['Age_mean'].mean()

# inplace = True, ['Age']를 대체해라..?
# inplace = False, ['Age']는 그대로 둬라

29.699117647058763

In [99]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Age_mean         0
dtype: int64

In [100]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_mean
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,22.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,38.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,26.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,35.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,35.0

# One-Hot-Encoding

In [101]:
train['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [102]:
# 여기서는 괄호를 치고 안치고 상관없음. 다만 연산자 and,or가 들어갈 경우 반드시 괄호.
train['Gender'] = (train['Sex'] == 'female')
train['Gender'].head()

0    False
1     True
2     True
3     True
4    False
Name: Gender, dtype: bool

In [103]:
train['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [104]:
test['Embarked'].value_counts()

S    270
C    102
Q     46
Name: Embarked, dtype: int64

In [105]:
test['Embarked'].isnull().sum()

0

In [106]:
train['Embarked_S'] = train['Embarked'] == 'S'
train['Embarked_C'] = train['Embarked'] == 'C'
train['Embarked_Q'] = train['Embarked'] == 'Q'

train['Embarked_S'].head()

0     True
1    False
2     True
3     True
4     True
Name: Embarked_S, dtype: bool

In [107]:
train['Embarked_S'].sum()

644

In [108]:
train['Embarked_C'].sum()

168

In [109]:
train['Embarked_Q'].sum()

77

In [110]:
train[['Embarked', 'Embarked_S', 'Embarked_C', 'Embarked_Q']].head()

  Embarked  Embarked_S  Embarked_C  Embarked_Q
0        S        True       False       False
1        C       False        True       False
2        S        True       False       False
3        S        True       False       False
4        S        True       False       False

In [111]:
test['Embarked_S'] = test['Embarked'] == 'S'
test['Embarked_C'] = test['Embarked'] == 'C'
test['Embarked_Q'] = test['Embarked'] == 'Q'

test['Embarked_S'].head()

0    False
1     True
2    False
3     True
4     True
Name: Embarked_S, dtype: bool

In [112]:
train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'Age_mean', 'Gender',
       'Embarked_S', 'Embarked_C', 'Embarked_Q'],
      dtype='object')

In [113]:
train['FamilySize'] = train['SibSp'] + train['Parch'] + 1
train['FamilySize'].value_counts()

1     537
2     161
3     102
4      29
6      22
5      15
7      12
11      7
8       6
Name: FamilySize, dtype: int64

# Binning을 해봅시다.

In [114]:
# Family를 S(Small), M(medium), Large(L)로 범위를 축소시킴.
# 그대로 FamilySize를 사용하면 overfitting될 수 있어서. 
# Desision tree의 조건(뻗어나가는 가지)을 최대한 적게하는 것이 효율적입니다.


train['Family'] = train['FamilySize']
train.loc[train['FamilySize'] == 1, 'Family'] = 'S'
train.loc[(train['FamilySize'] > 1) & (train['FamilySize'] < 5), 'Family'] = 'M'
train.loc[(train['FamilySize'] > 4) , 'Family'] = 'L'

In [115]:
test['FamilySize'] = test['SibSp'] + test['Parch'] + 1
test['FamilySize'].value_counts()

1     253
2      74
3      57
4      14
5       7
11      4
7       4
6       3
8       2
Name: FamilySize, dtype: int64

In [116]:
test['Family'] = test['FamilySize']
test.loc[(test['FamilySize'] == 1), 'Family'] = 'S'
test.loc[(test['FamilySize'] > 1) & (test['FamilySize'] < 5), 'Family'] = 'M'
test.loc[(test['FamilySize'] > 4), 'Family'] = 'L'

In [117]:
train['Family'].value_counts()

S    537
M    292
L     62
Name: Family, dtype: int64